MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAM4S2BA/mcu.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) %copyright_year%, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM4S2B_
#define _SAM4S2B_

/** \addtogroup SAM4S2B_definitions SAM4S2B definitions
  This file defines all structures and symbols for SAM4S2B:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM4S2B */
/* ************************************************************************** */
/** \addtogroup SAM4S2B_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  HardFault_IRQn        = -13, /**<  3 HardFault Interrupt                   */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M4 System Tick Interrupt       */
/******  SAM4S2B specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAM4S2B Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAM4S2B Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAM4S2B Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAM4S2B Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAM4S2B Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAM4S2B Power Management Controller (PMC) */
  EFC0_IRQn            =  6, /**<  6 SAM4S2B Enhanced Embedded Flash Controller 0 (EFC0) */
  UART0_IRQn           =  8, /**<  8 SAM4S2B UART 0 (UART0) */
  UART1_IRQn           =  9, /**<  9 SAM4S2B UART 1 (UART1) */
  PIOA_IRQn            = 11, /**< 11 SAM4S2B Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 12, /**< 12 SAM4S2B Parallel I/O Controller B (PIOB) */
  USART0_IRQn          = 14, /**< 14 SAM4S2B USART 0 (USART0) */
  USART1_IRQn          = 15, /**< 15 SAM4S2B USART 1 (USART1) */
  HSMCI_IRQn           = 18, /**< 18 SAM4S2B Multimedia Card Interface (HSMCI) */
  TWI0_IRQn            = 19, /**< 19 SAM4S2B Two Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 20, /**< 20 SAM4S2B Two Wire Interface 1 (TWI1) */
  SPI_IRQn             = 21, /**< 21 SAM4S2B Serial Peripheral Interface (SPI) */
  SSC_IRQn             = 22, /**< 22 SAM4S2B Synchronous Serial Controller (SSC) */
  TC0_IRQn             = 23, /**< 23 SAM4S2B Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAM4S2B Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAM4S2B Timer/Counter 2 (TC2) */
  ADC_IRQn             = 29, /**< 29 SAM4S2B Analog To Digital Converter (ADC) */
  DACC_IRQn            = 30, /**< 30 SAM4S2B Digital To Analog Converter (DACC) */
  PWM_IRQn             = 31, /**< 31 SAM4S2B Pulse Width Modulation (PWM) */
  CRCCU_IRQn           = 32, /**< 32 SAM4S2B CRC Calculation Unit (CRCCU) */
  ACC_IRQn             = 33, /**< 33 SAM4S2B Analog Comparator (ACC) */
  UDP_IRQn             = 34, /**< 34 SAM4S2B USB Device Port (UDP) */

  PERIPH_COUNT_IRQn    = 35  /**< Number of peripheral IDs */
} IRQn_Type;

